tienbk1995/STM32F407DISC/stm32f407GDisc_drivers/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <stm32f407xx.h>
#include "software_delay.h"


#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif


int main(void)
{
	GPIO_Handle_t LD3;
	GPIO_Handle_t LD4;
	GPIO_Handle_t LD5;
	GPIO_Handle_t LD6;

	GPIO_Config(&LD3, GPIOD, GPIO_PIN_NO_12, GPIO_MODE_OUT, GPIO_SPEED_FAST, GPIO_OP_TYPE_OD, GPIO_PIN_PU, 0);
	GPIO_Config(&LD4, GPIOD, GPIO_PIN_NO_13, GPIO_MODE_OUT, GPIO_SPEED_FAST, GPIO_OP_TYPE_PP, GPIO_NO_PUPD, 0);
	GPIO_Config(&LD5, GPIOD, GPIO_PIN_NO_14, GPIO_MODE_OUT, GPIO_SPEED_FAST, GPIO_OP_TYPE_PP, GPIO_NO_PUPD, 0);
	GPIO_Config(&LD6, GPIOD, GPIO_PIN_NO_15, GPIO_MODE_OUT, GPIO_SPEED_FAST, GPIO_OP_TYPE_PP, GPIO_NO_PUPD, 0);

	GPIO_PeriClockControl(GPIOD, ENABLE);
	GPIO_Init(&LD3);
	GPIO_Init(&LD4);
	GPIO_Init(&LD5);
	GPIO_Init(&LD6);

    /* Loop forever */
	while(1)
	{
		GPIO_ToggleOutputPin(LD3.pGPIOx, LD3.GPIO_PinConfig.GPIO_PinNumber);
		SoftwareDelay(500000);
		GPIO_ToggleOutputPin(LD4.pGPIOx, LD4.GPIO_PinConfig.GPIO_PinNumber);
		SoftwareDelay(500000);
		GPIO_ToggleOutputPin(LD5.pGPIOx, LD5.GPIO_PinConfig.GPIO_PinNumber);
		SoftwareDelay(500000);
		GPIO_ToggleOutputPin(LD6.pGPIOx, LD6.GPIO_PinConfig.GPIO_PinNumber);
		SoftwareDelay(500000);
	}
}
